'use client'
import React from "react";
import {Accordion, AccordionItem} from "@nextui-org/react";

function faqList() {

    const faqList=[
        {id:1, title: 'چطور سفارش هام رو توی سایت ثبت کنم؟', description:'با توجه به حجم سفارش شما و میزان دوری یا نزدیکی شما از دفاتر تجهیزات ما در تهران بین 1 ساعت تا 8 ساعت ، در شهر های دیگر بین 1 تا 7 روز ممکنه طول بکشه البته این بازه های زمانی دقیق نیست و با توجه به عوامل مختلف ممکنه کمتر و بیشتر بشه'},
        {id:2, title: "چقدر طول میکشه تا تجهیزات واسمون ارسال بشه؟", description:'با توجه به حجم سفارش شما و میزان دوری یا نزدیکی شما از دفاتر تجهیزات ما در تهران بین 1 ساعت تا 8 ساعت ، در شهر های دیگر بین 1 تا 7 روز ممکنه طول بکشه البته این بازه های زمانی دقیق نیست و با توجه به عوامل مختلف ممکنه کمتر و بیشتر بشه'},
        {id:3, title: "چقدر طول میکشه تا تجهیزات واسمون ارسال بشه؟", description:'با توجه به حجم سفارش شما و میزان دوری یا نزدیکی شما از دفاتر تجهیزات ما در تهران بین 1 ساعت تا 8 ساعت ، در شهر های دیگر بین 1 تا 7 روز ممکنه طول بکشه البته این بازه های زمانی دقیق نیست و با توجه به عوامل مختلف ممکنه کمتر و بیشتر بشه'},
        {id:4, title: "چقدر طول میکشه تا تجهیزات واسمون ارسال بشه؟", description:'با توجه به حجم سفارش شما و میزان دوری یا نزدیکی شما از دفاتر تجهیزات ما در تهران بین 1 ساعت تا 8 ساعت ، در شهر های دیگر بین 1 تا 7 روز ممکنه طول بکشه البته این بازه های زمانی دقیق نیست و با توجه به عوامل مختلف ممکنه کمتر و بیشتر بشه'},
        {id:5, title: "چقدر طول میکشه تا تجهیزات واسمون ارسال بشه؟", description:'با توجه به حجم سفارش شما و میزان دوری یا نزدیکی شما از دفاتر تجهیزات ما در تهران بین 1 ساعت تا 8 ساعت ، در شهر های دیگر بین 1 تا 7 روز ممکنه طول بکشه البته این بازه های زمانی دقیق نیست و با توجه به عوامل مختلف ممکنه کمتر و بیشتر بشه'},
        {id:6, title: "چقدر طول میکشه تا تجهیزات واسمون ارسال بشه؟", description:'با توجه به حجم سفارش شما و میزان دوری یا نزدیکی شما از دفاتر تجهیزات ما در تهران بین 1 ساعت تا 8 ساعت ، در شهر های دیگر بین 1 تا 7 روز ممکنه طول بکشه البته این بازه های زمانی دقیق نیست و با توجه به عوامل مختلف ممکنه کمتر و بیشتر بشه'}
    ]

  return (
    <Accordion className="  w-11/12 mx-auto  dark:bg-[#0F172A]" variant="shadow" >
        {faqList.map(item=>(
          <AccordionItem key={item.id} title={item.title} className="text-3xl font-bold ">
            <p className="text-lg font-normal  ">{item.description}</p>
          </AccordionItem>
      ))}
    </Accordion>
  )
}

export default faqList